---
kind: property
id: P:Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.MappedWidthDiameter
source: html/88b19b82-f5ca-9952-b935-4228715291b5.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.MappedWidthDiameter Property

The mapped size for the width or diameter of the straight.

## Syntax (C#)
```csharp
public double MappedWidthDiameter { get; set; }
```